![png](Data/ERD.png)

In [3]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'root' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
engine = create_engine(connection)

In [4]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created')

It exists!

In [5]:
q = '''SHOW TABLES'''
pd.read_sql(q, engine)

   Tables_in_chinook
0              album
1             artist
2           customer
3           employee
4              genre
5            invoice
6        invoiceline
7          mediatype
8           playlist
9      playlisttrack
10             track

1. What is the most a customer has spent on a single purchase and what is their customerId?

In [9]:
q = '''SELECT 
    customerId, MAX(Total)
FROM
    invoice
GROUP BY customerId
ORDER BY MAX(Total) DESC
LIMIT 1'''
pd.read_sql(q, engine)

   customerId  MAX(Total)
0           6       25.86

In [10]:
q = '''SELECT 
    customerId, Total
FROM
    invoice
ORDER BY Total DESC
LIMIT 1'''
pd.read_sql(q, engine)

   customerId  Total
0           6  25.86

2. What country is the customer with the largest total bill from (from question 2)?

In [11]:
q = '''SELECT 
    invoice.customerId, invoice.Total, customer.Country
FROM
    invoice
        JOIN
    customer ON invoice.CustomerId = customer.CustomerId
ORDER BY invoice.Total DESC
LIMIT 1'''
pd.read_sql(q, engine)

   customerId  Total         Country
0           6  25.86  Czech Republic

3. Which customerID made the fewest purchases (invoices)?

In [12]:
q = '''SELECT 
    customerId, COUNT(Total)
FROM
    invoice
GROUP BY customerId
ORDER BY COUNT(Total) DESC
LIMIT 1'''
pd.read_sql(q, engine)

   customerId  COUNT(Total)
0           1             7

4. Retrieve the id, name, and # of playlists for tracks that appear on playlists more than 4 times?

In [13]:
q = '''SELECT 
    playlisttrack.TrackId,
    track.Name,
    COUNT(playlisttrack.PlaylistId) AS counts
FROM
    playlisttrack
        JOIN
    track ON playlisttrack.TrackId = track.TrackId
GROUP BY track.TrackId
HAVING counts >= 4'''
pd.read_sql(q, engine)

     TrackId                                               Name  counts
0          3                                    Fast As a Shark       4
1          4                                  Restless and Wild       4
2          5                               Princess of the Dawn       4
3         52                                     Man In The Box       4
4        215                                            Sozinho       4
..       ...                                                ...     ...
106     3499  Pini Di Roma (Pinien Von Rom)  I Pini Della Vi...       5
107     3500  String Quartet No. 12 in C Minor, D. 703 "Quar...       4
108     3501               L'orfeo, Act 3, Sinfonia (Orchestra)       4
109     3502  Quintet for Horn, Violin, 2 Violas, and Cello ...       4
110     3503                                      Koyaanisqatsi       5

[111 rows x 3 columns]